-- 大招，普攻，追击条件，追击效果
local Heroes = {
	-- 蜀 SSR
	{"张飞","浮空","倒地","倒地","击退","蜀"},
	{"关羽","浮空","倒地","浮空","浮空","蜀"},
	{"赵云","倒地","浮空","浮空","倒地","蜀"},
	{"刘备","倒地","倒地","击退","浮空","蜀"},
	{"诸葛亮","浮空","浮空","倒地","浮空","蜀"},
	{"马超","击退","浮空","击退","倒地","蜀"},
	{"黄忠","击退","击退","击退","浮空","蜀"},
	-- 蜀 SR
	{"徐庶","/","击退","击退","/","蜀"},
	{"魏延","/","浮空","击退","/","蜀"},
	{"孟获","倒地","倒地","击退","/","蜀"},
	-- 魏 SSR
	{"曹操","倒地","倒地","倒地","浮空","魏"},
	{"夏侯惇","击退","浮空","倒地","倒地","魏"},
	{"郭嘉","浮空","浮空","浮空","倒地","魏"},
	{"夏侯渊","击退","击退","击退","击退","魏"},
	{"许褚","击退","倒地","击退","浮空","魏"},
	{"典韦","击退","倒地","击退","倒地","魏"},
	{"张辽","浮空","倒地","浮空","击退","魏"},
	-- 魏 SR
	{"张郃","/","击退","击退","/","魏"},
	{"于禁","浮空","浮空","倒地","/","魏"},
	{"徐晃","浮空","倒地","倒地","/","魏"},
	-- 吴 SSR
	{"孙策","灼烧","浮空","击退","倒地","吴"},
	{"周瑜","灼烧","浮空","浮空","浮空","吴"},
	{"太史慈","倒地","击退","浮空","击退","吴"},
	{"孙坚","倒地","倒地","倒地","浮空","吴"},
	{"大乔","灼烧","浮空","浮空","击退","吴"},
	{"小乔","灼烧","击退","浮空","倒地","吴"},
	{"周泰","浮空","击退","击退","浮空","吴"},
	{"甘宁","倒地","倒地","倒地","浮空","吴"},
	-- 吴 SR
	{"黄盖","浮空","倒地","倒地","/","吴"},
	{"鲁肃","击退","击退","浮空","/","吴"},
	{"凌统","浮空","浮空","击退","/","吴"},
	-- 群 SSR
	{"吕布","浮空","浮空","浮空","击退","群"},
	{"张角","/","浮空","浮空","倒地","群"},
	{"董卓","浮空","倒地","倒地","浮空","群"},
	{"袁绍","浮空","倒地","倒地","浮空","群"},
	{"貂蝉","魅惑","倒地","击退","浮空","群"},
	{"贾诩","浮空","击退","击退","浮空","群"},
	{"高顺","浮空","击退","击退","击退","群"},
	{"华佗","回复","倒地","反击","击退","群"},
	-- 群 SR
	{"颜良","击退","浮空","浮空","/","群"},
	{"文丑","浮空","浮空","击退","/","群"},
	{"司马徽","击退","击退","浮空","/","群"},
}

-- 错别字自适应
Heroes["许诸"] = Heroes["许褚"]
Heroes["许禇"] = Heroes["许褚"]
Heroes["夏侯淳"] = Heroes["夏侯惇"]
Heroes["张合"] = Heroes["张郃"]
Heroes["司马微"] = Heroes["司马徽"]

local HeroMap = {
	Indexes = {
		Name         = 1, -- 英雄名
		Rage         = 2, -- 怒技
		NormalAttack = 3, -- 普攻
		Chase1       = 4, -- 追击条件
		Chase2       = 5, -- 追击结果
		Faction      = 6, -- 阵营
	},
}

local IDX_Name = HeroMap.Indexes.Name

for _, hero in ipairs(Heroes) do
	HeroMap[hero[IDX_Name]] = hero
end

return HeroMap
