-- 大招，普攻，追击条件，追击效果
local Heroes = {
	-- 蜀 SSR
	["张飞"] = {"浮空","倒地","倒地","击退"},
	["关羽"] = {"浮空","倒地","浮空","浮空"},
	["赵云"] = {"倒地","浮空","浮空","倒地"},
	["刘备"] = {"倒地","倒地","击退","浮空"},
	["诸葛亮"] = {"浮空","浮空","倒地","浮空"},
	["马超"] = {"击退","浮空","击退","倒地"},
	["黄忠"] = {"击退","击退","击退","浮空"},
	-- 蜀 SR
	["徐庶"] = {"/","击退","击退","/"},
	["魏延"] = {"/","浮空","击退","/"},
	["孟获"] = {"倒地","倒地","击退","/"},
	-- 魏 SSR
	["曹操"] = {"倒地","倒地","倒地","浮空"},
	["夏侯惇"] = {"击退","浮空","倒地","倒地"},
	["郭嘉"] = {"浮空","浮空","浮空","倒地"},
	["夏侯渊"] = {"击退","击退","击退","击退"},
	["许褚"] = {"击退","倒地","击退","浮空"},
	["典韦"] = {"击退","倒地","击退","倒地"},
	["张辽"] = {"浮空","倒地","浮空","击退"},
	-- 魏 SR
	["张郃"] = {"/","击退","击退","/"},
	["于禁"] = {"浮空","浮空","倒地","/"},
	["徐晃"] = {"浮空","倒地","倒地","/"},
	-- 吴 SSR
	["孙策"] = {"灼烧","浮空","击退","倒地"},
	["周瑜"] = {"灼烧","浮空","浮空","浮空"},
	["太史慈"] = {"倒地","击退","浮空","击退"},
	["孙坚"] = {"倒地","倒地","倒地","浮空"},
	["大乔"] = {"灼烧","浮空","浮空","击退"},
	["小乔"] = {"灼烧","击退","浮空","倒地"},
	["周泰"] = {"浮空","击退","击退","浮空"},
	["甘宁"] = {"倒地","倒地","倒地","浮空"},
	-- 吴 SR
	["黄盖"] = {"浮空","倒地","倒地","/"},
	["鲁肃"] = {"击退","击退","浮空","/"},
	["凌统"] = {"浮空","浮空","击退","/"},
	-- 群 SSR
	["吕布"] = {"浮空","浮空","浮空","击退"},
	["张角"] = {"/","浮空","浮空","倒地"},
	["董卓"] = {"浮空","倒地","倒地","浮空"},
	["袁绍"] = {"浮空","倒地","倒地","浮空"},
	["貂蝉"] = {"魅惑","倒地","击退","浮空"},
	["贾诩"] = {"浮空","击退","击退","浮空"},
	["高顺"] = {"浮空","击退","击退","击退"},
	["华佗"] = {"回复","倒地","反击","击退"},
	-- 群 SR
	["颜良"] = {"击退","浮空","浮空","/"},
	["文丑"] = {"浮空","浮空","击退","/"},
	["司马徽"] = {"击退","击退","浮空","/"},
}

-- 错别字自适应
Heroes["许诸"] = Heroes["许褚"]
Heroes["许禇"] = Heroes["许褚"]
Heroes["夏侯淳"] = Heroes["夏侯惇"]
Heroes["张合"] = Heroes["张郃"]
Heroes["司马微"] = Heroes["司马徽"]

return Heroes
